ZigEmbeddedGroup/microzig/src/modules/chips/atsame51j20a/ATSAME51J20A.svd
            <register>
               <name>PRICTRL0</name>
               <description>Priority Control 0</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x40404040</resetValue>
               <fields>
                  <field>
                     <name>LVLPRI0</name>
                     <description>Level 0 Channel Priority Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS0</name>
                     <description>Level 0 Quality of Service</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS0Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN0</name>
                     <description>Level 0 Round-Robin Scheduling Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI1</name>
                     <description>Level 1 Channel Priority Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS1</name>
                     <description>Level 1 Quality of Service</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS1Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN1</name>
                     <description>Level 1 Round-Robin Scheduling Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI2</name>
                     <description>Level 2 Channel Priority Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS2</name>
                     <description>Level 2 Quality of Service</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS2Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN2</name>
                     <description>Level 2 Round-Robin Scheduling Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI3</name>
                     <description>Level 3 Channel Priority Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>QOS3</name>
                     <description>Level 3 Quality of Service</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS3Select</name>
                        <enumeratedValue>
                           <name>REGULAR</name>
                           <description>Regular delivery</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTAGE</name>
                           <description>Bandwidth shortage</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SENSITIVE</name>
                           <description>Latency sensitive</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRITICAL</name>
                           <description>Latency critical</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRLVLEN3</name>
                     <description>Level 3 Round-Robin Scheduling Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTPEND</name>
               <description>Interrupt Pending</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TERR</name>
                     <description>Transfer Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Transfer Complete</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FERR</name>
                     <description>Fetch Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEND</name>
                     <description>Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTATUS</name>
               <description>Interrupt Status</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHINT0</name>
                     <description>Channel 0 Pending Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT1</name>
                     <description>Channel 1 Pending Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT2</name>
                     <description>Channel 2 Pending Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT3</name>
                     <description>Channel 3 Pending Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT4</name>
                     <description>Channel 4 Pending Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT5</name>
                     <description>Channel 5 Pending Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT6</name>
                     <description>Channel 6 Pending Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT7</name>
                     <description>Channel 7 Pending Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT8</name>
                     <description>Channel 8 Pending Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT9</name>
                     <description>Channel 9 Pending Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT10</name>
                     <description>Channel 10 Pending Interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT11</name>
                     <description>Channel 11 Pending Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT12</name>
                     <description>Channel 12 Pending Interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT13</name>
                     <description>Channel 13 Pending Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT14</name>
                     <description>Channel 14 Pending Interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT15</name>
                     <description>Channel 15 Pending Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT16</name>
                     <description>Channel 16 Pending Interrupt</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT17</name>
                     <description>Channel 17 Pending Interrupt</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT18</name>
                     <description>Channel 18 Pending Interrupt</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT19</name>
                     <description>Channel 19 Pending Interrupt</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT20</name>
                     <description>Channel 20 Pending Interrupt</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT21</name>
                     <description>Channel 21 Pending Interrupt</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT22</name>
                     <description>Channel 22 Pending Interrupt</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT23</name>
                     <description>Channel 23 Pending Interrupt</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT24</name>
                     <description>Channel 24 Pending Interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT25</name>
                     <description>Channel 25 Pending Interrupt</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT26</name>
                     <description>Channel 26 Pending Interrupt</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT27</name>
                     <description>Channel 27 Pending Interrupt</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT28</name>
                     <description>Channel 28 Pending Interrupt</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT29</name>
                     <description>Channel 29 Pending Interrupt</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT30</name>
                     <description>Channel 30 Pending Interrupt</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHINT31</name>
                     <description>Channel 31 Pending Interrupt</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
