ZigEmbeddedGroup/microzig/src/modules/chips/atsame51j20a/ATSAME51J20A.svd
            <register>
               <name>BBPS</name>
               <description>Battery Backup Power Switch</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CONF</name>
                     <description>Battery Backup Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CONFSelect</name>
                        <enumeratedValue>
                           <name>BOD33</name>
                           <description>The power switch is handled by the BOD33</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORCED</name>
                           <description>In Backup Domain, the backup domain is always supplied by battery backup power</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAKEEN</name>
                     <description>Wake Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKOUT</name>
               <description>Backup Output Control</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENOUT0</name>
                     <description>Enable OUT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENOUT1</name>
                     <description>Enable OUT1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLROUT0</name>
                     <description>Clear OUT0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLROUT1</name>
                     <description>Clear OUT1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETOUT0</name>
                     <description>Set OUT0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETOUT1</name>
                     <description>Set OUT1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCTGLOUT0</name>
                     <description>RTC Toggle OUT0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCTGLOUT1</name>
                     <description>RTC Toggle OUT1</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKIN</name>
               <description>Backup Input Control</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKIN0</name>
                     <description>Backup Input 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKIN1</name>
                     <description>Backup Input 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>TC0</name>
         <version>U22493.0.0</version>
         <description>Basic Timer Counter</description>
         <groupName>TC</groupName>
         <prependToName>TC_</prependToName>
         <baseAddress>0x40003800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TC0</name>
            <value>107</value>
         </interrupt>
         <registers>
            <cluster>
               <name>COUNT8</name>
               <description>8-bit Counter Mode</description>
               <headerStructName>TcCount8</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Timer Counter Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>COUNT16</name>
                              <description>Counter in 16-bit mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT8</name>
                              <description>Counter in 8-bit mode</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT32</name>
                              <description>Counter in 32-bit mode</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PRESCSYNC</name>
                        <description>Prescaler and Counter Synchronization</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PRESCSYNCSelect</name>
                           <enumeratedValue>
                              <name>GCLK</name>
                              <description>Reload or reset the counter on next generic clock</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PRESC</name>
                              <description>Reload or reset the counter on next prescaler clock</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESYNC</name>
                              <description>Reload or reset the counter on next generic clock and reset the prescaler counter</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run during Standby</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONDEMAND</name>
                        <description>Clock On Demand</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRESCALER</name>
                        <description>Prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>PRESCALERSelect</name>
                           <enumeratedValue>
                              <name>DIV1</name>
                              <description>Prescaler: GCLK_TC</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>Prescaler: GCLK_TC/2</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>Prescaler: GCLK_TC/4</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>Prescaler: GCLK_TC/8</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>Prescaler: GCLK_TC/16</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>Prescaler: GCLK_TC/64</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>Prescaler: GCLK_TC/256</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1024</name>
                              <description>Prescaler: GCLK_TC/1024</description>
                              <value>7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ALOCK</name>
                        <description>Auto Lock</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CAPTEN0</name>
                        <description>Capture Channel 0 Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CAPTEN1</name>
                        <description>Capture Channel 1 Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COPEN0</name>
                        <description>Capture On Pin 0 Enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COPEN1</name>
                        <description>Capture On Pin 1 Enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CAPTMODE0</name>
                        <description>Capture Mode Channel 0</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CAPTMODE0Select</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Default capture</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMIN</name>
                              <description>Minimum capture</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMAX</name>
                              <description>Maximum capture</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CAPTMODE1</name>
                        <description>Capture mode Channel 1</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CAPTMODE1Select</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Default capture</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMIN</name>
                              <description>Minimum capture</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CAPTMAX</name>
                              <description>Maximum capture</description>
                              <value>2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLBCLR</name>
                  <description>Control B Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Counter Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LUPD</name>
                        <description>Lock Update</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONESHOT</name>
                        <description>One-Shot on Counter</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Force a start, restart or retrigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STOP</name>
                              <description>Force a stop</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPDATE</name>
                              <description>Force update of double-buffered register</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READSYNC</name>
                              <description>Force a read synchronization of COUNT</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DMAOS</name>
                              <description>One-shot DMA trigger</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLBSET</name>
                  <description>Control B Set</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Counter Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LUPD</name>
                        <description>Lock Update</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONESHOT</name>
                        <description>One-Shot on Counter</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RETRIGGER</name>
                              <description>Force a start, restart or retrigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STOP</name>
                              <description>Force a stop</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPDATE</name>
                              <description>Force update of double-buffered register</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READSYNC</name>
                              <description>Force a read synchronization of COUNT</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DMAOS</name>
                              <description>One-shot DMA trigger</description>
                              <value>5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
